app/views/seasons/index.html.erb

SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" IN (?, ?, ?)  [["season_id", 4], ["season_id", 5], ["season_id", 6]]
---
        <tbody>
          <% season.episodes.each do |episode| %>