app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (id NOT IN (19,20)) ORDER BY "movies"."created_at" ASC
SELECT "movies"."id" FROM "movies" INNER JOIN "movies_users" ON "movies"."id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "movie_users" WHERE "movie_users"."user_id" = ?  [["user_id", 1]]
SELECT "movie_users"."movie_id" FROM "movie_users" WHERE "movie_users"."user_id" = ?  [["user_id", 1]]
---
  def index
    @movies = Movie.all
    if current_user.movie_users.size > 0
      @movies = @movies.where("id NOT IN (?)", MovieUser.where(user_id: current_user.id).pluck(:movie_id))

INSERT INTO "movie_users" ("user_id", "movie_id", "video_quality_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["movie_id", 2], ["video_quality_id", 2], ["created_at", "2019-05-19 04:58:52.998658"], ["updated_at", "2019-05-19 04:58:52.998658"]]
---
  def purchase
    MovieUser.create(user_id: current_user.id, movie_id: @movie.id, video_quality_id: params[:type])