app/controllers/seasons_controller.rb

SELECT  "seasons".* FROM "seasons" ORDER BY seasons.created_at, episodes.episode_number LIMIT ?  [["LIMIT", 1]]
SELECT "seasons"."id" FROM "seasons" INNER JOIN "seasons_users" ON "seasons"."id" = "seasons_users"."season_id" WHERE "seasons_users"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "season_users" WHERE "season_users"."user_id" = ?  [["user_id", 1]]
SELECT "season_users"."season_id" FROM "season_users" WHERE "season_users"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" IN (?, ?, ?)  [["season_id", 13], ["season_id", 14], ["season_id", 15]]
SELECT "seasons".* FROM "seasons" ORDER BY "seasons"."created_at" ASC, "episode_number" ASC
---
  def index
    @seasons = Season.all
    if current_user.season_users.size > 0
      @seasons = @seasons.where("seasons.id NOT IN (?)", SeasonUser.where(user_id: current_user.id).pluck(:season_id))
    end
    @seasons = @seasons.includes(:episodes).order("seasons.created_at, episodes.episode_number").references(:episodes)

INSERT INTO "season_users" ("user_id", "season_id", "video_quality_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["season_id", 1], ["video_quality_id", 1], ["created_at", "2019-05-19 05:01:12.480282"], ["updated_at", "2019-05-19 05:01:12.480282"]]
---
  def purchase
    SeasonUser.create(user_id: current_user.id, season_id: @season.id, video_quality_id: params[:type])

SELECT  "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_season
      @season = Season.find(params[:id])