app/controllers/shows_controller.rb

    def index
        seasons = Season.all
        movies = Movie.all
---
SELECT seasons.*, NULL as type FROM "seasons"
SELECT movies.*, NULL as type  FROM "movies"