app/controllers/users_controller.rb

  def index
    seasons = Season.where("id in (?)", SeasonUser.where(user_id: current_user.id).pluck(:season_id))
    movies = Movie.where("id in (?)", MovieUser.where(user_id: current_user.id).pluck(:movie_id))
---
SELECT "season_users"."season_id" FROM "season_users" WHERE "season_users"."user_id" = ?  [["user_id", 1]]
SELECT "movie_users"."movie_id" FROM "movie_users" WHERE "movie_users"."user_id" = ?  [["user_id", 1]]